Revit 2018 API
ExternalResourceReference Properties
The ExternalResourceReference type exposes the following members.
Properties
Name | Description
InSessionPath
The path stores the full display path which includes the server name plus the path provided by ExternalResourceServer.
The path that Revit will present for user recognizing and browsing to this resource during one session of Revit.
This property allows ExternalResourceServers to handle cases where the path to a resource may vary between Revit sessions. For example, if this ExternalResourceReference refers to a resource in a folder, this property can be used to store the current path of the resource. If the resource is moved to another folder later, the ExternalResourceServer could calculate the correct path for the resource from resource identification information when it is loaded and store it in this property, so that it will work correctly even if the rvt file is opened in a different location.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ServerId
 The id of the server that Revit is expecting to provide the external resource.
Version
 The version of the external data that was most recently loaded in Revit.
See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace